---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.Erase(Autodesk.Revit.DB.FamilyType)
source: html/40237e8c-5d7c-26f4-f354-56b2333b604b.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	FamilyType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.FamilyType`)